/**
 * 天气数据模型
 * @author ronizhang
 */
(function (namespace) {

    var WeatherModel = function () {
        var format_wea_map = {
            '无风向微风':'无持续风向 微风'
        };
        var wea_icon_25={
            '晴':'0 0px',
            '多云':'0 -40px',
            '暴雪':'0 -480px',
            '大雪-暴雪':'0 -480px',
            '暴雨':'0 -360px',
            '大雨-暴雨':'0 -360px',
            '暴雨-大暴雨':'0 -360px',
            '大暴雨-特大暴雨':'0 -360px',
            '大暴雪':'0 -480px',
            '飑':'0 -880px',
            '大雪':'0 -440px',
            '中雪-大雪':'0 -440px',
            '大雨':'0 -320px',
            '中雨-大雨':'0 -320px',
            '浮层':'0 -920px',
            '雷阵雨':'0 -160px',
            '雷阵雨并伴有冰雹':'0 -200px',
            '霾':'0 -920px',
            '轻雾':'0 -840px',
            '雾':'0 -840px',
            '冰雹':'0 -680px',
            '沙尘暴':'0 -760px',
            '强沙尘暴':'0 -760px',
            '特大暴雪':'0 -520px',
            '小雪':'0 -600px',
            '小雨':'0 -240px',
            '扬沙':'0 -720px',
            '浮尘':'0 -920px',
            '龙卷风':'0 -800px',
            '弱高吹雪':'0 -600px',
            '阴':'0 -80px',
            '雨夹雪':'0 -400px',
            '冻雨':'0 -960px',
            '阵雪':'0 -560px',
            '阵雨':'0 -120px',
            '中雪':'0 -640px',
            '小雪-中雪':'0 -640px',
            '小雨-中雨':'0 -280px',
            '中雨':'0 -280px'
        };
        var wea_icon_32 = {
            '晴':'0',
            '多云':'18',
            '暴雪':'2',
            '大雪-暴雪':'2',
            '暴雨':'3',
            '大雨-暴雨':'3',
            '暴雨-大暴雨':'3',
            '大暴雨-特大暴雨':'3',
            '大暴雪':'4',
            '飑':'5',
            '大雪':'6',
            '中雪-大雪':'6',
            '大雨':'7',
            '中雨-大雨':'7',
            '雷阵雨':'9',
            '雷阵雨并伴有冰雹':'10',
            '霾':'11',
            '轻雾':'11',
            '雾':'11',
            '强沙尘暴':'12',
            '特大暴雪':'13',
            '小雪':'14',
            '小雨':'15',
            '扬沙':'16',
            '浮尘':'17',
            '龙卷风':'5',
            '弱高吹雪':'14',
            '阴':'1',
            '雨夹雪':'19',
            '冻雨':'19',
            '阵雪':'20',
            '阵雨':'21',
            '中雪':'22',
            '小雪-中雪':'22',
            '小雨-中雨':'23',
            '中雨':'23'
        };

        var zhishu_map = {
            chuanyi:{
                1:['炎热', '薄型T恤衫'],
                2:['热舒适', '短套装、T恤夏季服装'],
                3:['舒适', '长袖服装'],
                4:['凉舒适', '薄型套装等春秋过渡装'],
                5:['温凉', '夹衣或西服套装加薄羊毛衫'],
                6:['凉', '厚外套加毛衣等春秋服装'],
                7:['冷', '棉衣加羊毛衫等冬季服装'],
                8:['寒冷', '厚羽绒服等隆冬服装']
            },
            shushi:{
                0:['舒适', '白天不太热也不太冷，风力不大，会感到比较清爽和舒适'],
                1:['较舒适', '暖，会感到有点儿闷热，但大部分人仍会有比较舒适的感觉'],
                2:['较不舒适', '热，会感到有些热，较不舒适'],
                3:['很不舒适', '很热，会感到很闷热，很不舒适'],
                4:['极不舒适', '酷热，会感到酷热难耐，极为不适，请注意防暑降温'],
                6:['较舒适', '凉，早晚会感觉偏凉，但大部分人仍会有比较舒适的感觉'],
                7:['较不舒适', '冷，感觉偏冷，不很舒适，请注意添加衣物，以防感冒'],
                8:['很不舒适', '寒冷，感觉很冷，不舒适，请注意保暖防寒'],
                9:['极不舒适', '十分寒冷，感觉十分寒冷，极不舒适，请注意保暖防寒']
            },
            ganmao:{
                1:['少发', '各项气象条件适宜，发生感冒机率较低'],
                2:['较易发', '较易发生感冒，体质较弱的朋友请注意适当防护'],
                3:['易发', '发生感冒机率较大，请加强自我防护避免感冒'],
                4:['极易发', '极易发生感冒，请特别注意增加衣服保暖防寒避免感冒']
            },
            xiche:{
                1:['适宜', '适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车'],
                2:['较适宜', '较适宜洗车，未来一天无雨，风力较小，较适合擦洗汽车'],
                3:['较不宜', '较不宜洗车，擦洗一新的汽车可能会蒙上污垢'],
                4:['不宜', '不宜洗车，路上的泥水可能会再次弄脏您的爱车']
            },
            kqwr:{
                1:['空气质量优', '非常有利于空气污染物稀释、扩散和清除，可在室外正常活动'],
                2:['空气质量良', '有利于空气污染物稀释、扩散和清除，可在室外正常活动'],
                3:['空气质量中', '对空气污染物稀释、扩散和清除无明显影响，易感人群应适当减少室外活动时间'],
                4:['空气质量较差', '较不利于空气污染物稀释、扩散和清除，请适当减少室外活动时间'],
                5:['空气质量差', '不利于空气污染物稀释、扩散和清除，请尽量避免在室外长时间活动']
            }
        };

        var aireInfo = {
            1:{
                name:'空气质量优',
                title:'空气质量令人满意，基本无空气污染',
                content:'各类人群可正常活动'
            },
            2:{
                name:'空气质量良',
                title:'空气质量可接受，某些污染物可能对异常敏感人群健康有较弱影响',
                content:'极少数异常敏感人群应减少户外活动'
            },
            3:{
                name:'轻度污染',
                title:'易感人群症状有轻度加剧，健康人群出现刺激症状',
                content:'儿童、老年人及心脏病、呼吸系统疾病患者应减少长时间、高强度的户外锻炼'
            },
            4:{
                name:'中度污染',
                title:'易感人群症状加剧，可能对健康人群心脏、呼吸系统有影响',
                content:'儿童、老年人及心脏病、呼吸系统疾病患者避免长时间、高强度的户外锻炼，一般人群适量减少户外运动'
            },
            5:{
                name:'重度污染',
                title:'心脏病和肺病患者症状显著加剧，健康人群运动耐受力降低',
                content:'儿童、老年人及心脏病、肺病患者应停留在室内，停止户外运动，一般人群减少户外运动'
            },
            6:{
                name:'严重污染',
                title:'健康人群运动耐受力降低，有明显症状，提前出现某些疾病',
                content:'儿童、老年人和病人应停留在室内，避免体力消耗，一般人群避免户外活动'
            }
        }

        var aireClassName = {
            1:'excellent',
            2:'good',
            3:'mild',
            4:'medium',
            5:'severe',
            6:'serious'
        }
        var getAireValue = function (aire) {
            aire = parseInt(aire);
            if (aire <= 50) {
                aire = 1;
            } else if (aire > 50 && aire <= 100) {
                aire = 2;
            } else if (aire > 100 && aire <= 150) {
                aire = 3;
            } else if (aire > 150 && aire <= 200) {
                aire = 4;
            } else if (aire > 200 && aire <= 300) {
                aire = 5;
            } else if (aire > 300) {
                aire = 6;
            }
            return aire;
        }

        this.getWeatherIcon25=function(w){
            var code = wea_icon_25[w];
            if (typeof(code) !== 'undefined') {
                return code;
            }
            return "0 0px";
        }
        /**
         *
         * @param w
         */
        this.getWeatherIcon32 = function (w) {
            var code = wea_icon_32[w];
            if (typeof(code) !== 'undefined') {
                return code;
            }
            return 0;
        }
        /**
         *
         * @param aire
         * @param hasapi
         * @return {*}
         */
        this.getAireClass = function (aire, hasapi) {
            if (hasapi) {
                aire = getAireValue(aire);
            } else {
                if (parseInt(aire) >= 3) {
                    aire = parseInt(aire) + 1;
                }
            }
            return aireClassName[aire];
        }
        /**
         * 获取空气指数说明
         * @param aire
         * @return {*}
         */
        this.getAireInfoDes = function (aire) {
            aire = getAireValue(aire);
            return aireInfo[aire];
        }

        /**
         * 获取指数信息
         */
        this.getZhiShu = function (num, type) {
            return zhishu_map[type][num] ? zhishu_map[type][num] : ['', ''];
        };


        this.weaFormat = function (name) {
            return format_wea_map[name] ? format_wea_map[name] : name;
        };

    };

    namespace.WeatherModel = WeatherModel;

}(haoqq.namespace('weather')));